# CanBeDissolved Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormUtils..::..CanBeDissolved Method
FormUtils Class See Also
---
Validates that input contains one or more form elements or geom combinations containing form elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool CanBeDissolved(
	Document ADoc,
	ICollection<ElementId> elements
)
```

Visual Basic
---
```text
Public Shared Function CanBeDissolved ( _
	ADoc As Document, _
	elements As ICollection(Of ElementId) _
) As Boolean
```

Visual C++
---
```text
public:
static bool CanBeDissolved(
	Document^ ADoc,
	ICollection<ElementId^>^ elements
)
```

# ### Parameters
ADoc
    Type: Autodesk.Revit.DB..::..Document The document.
elements
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> A collection of elements.
# ### Return Value
True if inputs contain one or more form elements. Non-form element inputs are ignored. False if none of the inputs are form elements or do not contain form elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FormUtils Class
Autodesk.Revit.DB Namespace